Repository: DZXH-TX/LocaleSmith
Catalog: src/LocaleSmith.App/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr, ja_jp, ru_ru, zh_cn

# MainWindowTitle
source: LocaleSmith
zh_cn: 译匠

# RootNavigation.PaneTitle
source: LocaleSmith
zh_cn: 译匠

# DashboardNavigationItem.Content
source: Processing queue
fr_fr: File de traitement
ja_jp: 処理キュー
ru_ru: Очередь обработки
zh_cn: 处理队列

# ModelSourcesNavigationItem.Content
source: Model sources
fr_fr: Sources de modèles
ja_jp: モデルソース
ru_ru: Источники моделей
zh_cn: 模型源

# LogsNavigationItem.Content
source: Logs
fr_fr: Journaux
ja_jp: ログ
ru_ru: Журналы
zh_cn: 日志

# StartupErrorTitle.Text
source: The app could not start securely
fr_fr: L’application n’a pas pu démarrer de manière sécurisée
ja_jp: アプリを安全に起動できませんでした
ru_ru: Не удалось безопасно запустить приложение
zh_cn: 应用无法安全启动

# OnboardingStepPrefix.Text
source: Step
fr_fr: Étape
ja_jp: ステップ
ru_ru: Шаг
zh_cn: 第

# OnboardingStepSuffix.Text
source: of 4
fr_fr: sur 4
ru_ru: из 4
zh_cn: / 4 步

# OnboardingProgress.AutomationProperties.Name
source: First-run setup progress
fr_fr: Progression de la configuration initiale
ja_jp: 初回セットアップの進行状況
ru_ru: Ход первоначальной настройки
zh_cn: 首次设置进度

# OnboardingError.Title
source: Action required
fr_fr: Action requise
ja_jp: 対応が必要です
ru_ru: Требуется действие
zh_cn: 需要处理

# OnboardingStatus.Title
source: Setup status
fr_fr: État de la configuration
ja_jp: セットアップ状況
ru_ru: Состояние настройки
zh_cn: 设置状态

# WelcomeTitle.Text
source: Welcome to LocaleSmith
fr_fr: Bienvenue dans LocaleSmith
ja_jp: LocaleSmith へようこそ
ru_ru: Добро пожаловать в LocaleSmith
zh_cn: 欢迎使用译匠

# WelcomeBody.Text
source: Extract, incrementally translate, and rebuild Minecraft mods and resource packs. Each job uses one selected translation style and produces one matching artifact.
fr_fr: Extrayez, traduisez progressivement et reconstruisez des mods et packs de ressources Minecraft. Chaque tâche utilise un style de traduction sélectionné et produit un artefact correspondant.
ja_jp: Minecraft の Mod やリソースパックからテキストを抽出し、差分翻訳して再構築します。各ジョブでは翻訳スタイルを 1 つ選択し、それに対応する成果物を 1 つ生成します。
ru_ru: Извлекайте, поэтапно переводите и пересобирайте моды и наборы ресурсов Minecraft. Каждое задание использует один выбранный стиль перевода и создаёт один соответствующий артефакт.
zh_cn: 批量提取、增量翻译并重建 Minecraft 模组与资源包；每个任务选择一种翻译风格，并生成一个对应产物。

# WelcomePrivacy.Text
source: Local Ollama can stay entirely on this PC. Cloud models are used only after you configure them. API keys are never written to settings or logs.
fr_fr: Ollama local peut rester entièrement sur ce PC. Les modèles cloud ne sont utilisés qu’après leur configuration. Les clés API ne sont jamais écrites dans les paramètres ni les journaux.
ja_jp: ローカルの Ollama は、この PC 内だけで動作できます。クラウドモデルは、設定した場合にのみ使用されます。API キーが設定やログに書き込まれることはありません。
ru_ru: Ollama может работать полностью локально на этом компьютере. Облачные модели используются только после их настройки. Ключи API никогда не записываются в настройки или журналы.
zh_cn: 本地 Ollama 可完全在本机工作；云端模型仅在你配置后使用。API Key 不写入配置或日志。

# OnboardingLanguageSelector.Header
source: Interface language
fr_fr: Langue de l’interface
ja_jp: 表示言語
ru_ru: Язык интерфейса
zh_cn: 界面语言

# OnboardingLanguageHelp.Text
source: Changing the interface language requires a restart. Save and restart after choosing; LocaleSmith will return to this setup guide.
fr_fr: Le changement de langue de l’interface nécessite un redémarrage. Après votre choix, enregistrez et redémarrez ; LocaleSmith reviendra à ce guide de configuration.
ja_jp: 表示言語の変更には再起動が必要です。選択後に保存して再起動すると、このセットアップガイドに戻ります。
ru_ru: Для смены языка интерфейса требуется перезапуск. После выбора сохраните язык и перезапустите LocaleSmith — откроется этот мастер настройки.
zh_cn: 切换界面语言需要重新启动。选择后请保存并重启；重新打开后会回到此向导。

# OnboardingLanguageRestartButton.Content
source: Save language and restart
fr_fr: Enregistrer la langue et redémarrer
ja_jp: 言語を保存して再起動
ru_ru: Сохранить язык и перезапустить
zh_cn: 保存语言并重启

# OnboardingLanguageRestartButton.AutomationProperties.Name
source: Save the interface language and restart LocaleSmith
fr_fr: Enregistrer la langue de l’interface et redémarrer LocaleSmith
ja_jp: 表示言語を保存して LocaleSmith を再起動
ru_ru: Сохранить язык интерфейса и перезапустить LocaleSmith
zh_cn: 保存界面语言并重启译匠

# ModelPathChoiceTitle.Text
source: Choose the first model connection
fr_fr: Choisissez la première connexion à un modèle
ja_jp: 最初に使用するモデル接続を選択
ru_ru: Выберите первое подключение к модели
zh_cn: 选择首次模型连接方式

# LocalModelChoice.AutomationProperties.Name
source: Select local Ollama
fr_fr: Sélectionner Ollama local
ja_jp: ローカル Ollama を選択
ru_ru: Выбрать локальную модель Ollama
zh_cn: 选择 Ollama 本地模型

# LocalModelChoiceTitle.Text
source: Ollama local
ja_jp: ローカル Ollama
ru_ru: Локальная модель Ollama
zh_cn: Ollama 本地

# LocalModelChoiceBody.Text
source: Run an already-downloaded model on this PC without a cloud API key.
fr_fr: Exécutez sur ce PC un modèle déjà téléchargé, sans clé API cloud.
ja_jp: ダウンロード済みのモデルをこの PC で実行します。クラウドの API キーは不要です。
ru_ru: Запускайте уже загруженную модель на этом компьютере без облачного ключа API.
zh_cn: 在本机运行已下载模型，不需要云端 API Key。

# ModelPathSelectedStatus.Text
source: Local model selected
fr_fr: Modèle local sélectionné
ja_jp: ローカルモデルを選択済み
ru_ru: Выбрана локальная модель
zh_cn: 已选择本地模型

# NetworkModelChoice.AutomationProperties.Name
source: Select a network large-model API
fr_fr: Sélectionner une API réseau de grand modèle de langage
ja_jp: ネットワーク経由の大規模モデル API を選択
ru_ru: Выбрать сетевой API большой языковой модели
zh_cn: 选择大模型网络调用

# NetworkModelChoiceTitle.Text
source: Large model (network) API
fr_fr: API de grand modèle de langage (réseau)
ja_jp: 大規模モデル（ネットワーク）API
ru_ru: Сетевой API большой языковой модели
zh_cn: 大模型（网络）调用

# NetworkModelChoiceBody.Text
source: Configure DeepSeek, Qwen, Xiaomi MiMo, MiniMax, OpenAI, Doubao, Zhipu GLM, Kimi, or a custom compatible service.
fr_fr: Configurez DeepSeek, Qwen, Xiaomi MiMo, MiniMax, OpenAI, Doubao, Zhipu GLM, Kimi ou un service compatible personnalisé.
ja_jp: DeepSeek、Qwen、Xiaomi MiMo、MiniMax、OpenAI、Doubao、Zhipu GLM、Kimi、またはカスタム互換サービスを設定します。
ru_ru: Настройте DeepSeek, Qwen, Xiaomi MiMo, MiniMax, OpenAI, Doubao, Zhipu GLM, Kimi или собственный совместимый сервис.
zh_cn: 配置 DeepSeek、Qwen、Xiaomi MiMo、MiniMax、OpenAI、豆包、智谱 GLM、Kimi 或自定义兼容服务。

# NetworkModelPathSelectedStatus.Text
source: Network model selected
fr_fr: Modèle réseau sélectionné
ja_jp: ネットワークモデルを選択済み
ru_ru: Выбрана сетевая модель
zh_cn: 已选择网络模型

# WorkspaceTitle.Text
source: Choose workspace and CLI sandbox
fr_fr: Choisissez l’espace de travail et le bac à sable CLI
ja_jp: ワークスペースと CLI サンドボックスを選択
ru_ru: Выберите рабочую область и песочницу CLI
zh_cn: 选择工作区与 CLI 沙箱

# WorkspaceBody.Text
source: The workspace stores output. Command working directories and explicit path arguments are restricted to the sandbox or temporary directory.
fr_fr: L’espace de travail stocke les sorties. Les répertoires de travail des commandes et les arguments de chemin explicites sont limités au bac à sable ou au répertoire temporaire.
ja_jp: 出力はワークスペースに保存されます。コマンドの作業ディレクトリと明示的なパス引数は、サンドボックスまたは一時ディレクトリ内に制限されます。
ru_ru: В рабочей области хранятся выходные данные. Рабочие каталоги команд и явно указанные пути ограничены песочницей или временным каталогом.
zh_cn: 工作区保存输出；命令工作目录和显式路径参数被限制在沙箱或临时目录内。

# WorkspacePathInput.Header
source: Translation workspace
fr_fr: Espace de travail de traduction
ja_jp: 翻訳ワークスペース
ru_ru: Рабочая область перевода
zh_cn: 翻译工作区

# WorkspacePathInput.AutomationProperties.Name
source: Translation workspace path
fr_fr: Chemin de l’espace de travail de traduction
ja_jp: 翻訳ワークスペースのパス
ru_ru: Путь к рабочей области перевода
zh_cn: 翻译工作区路径

# SandboxPathInput.Header
source: CLI sandbox directory
fr_fr: Répertoire du bac à sable CLI
ja_jp: CLI サンドボックスディレクトリ
ru_ru: Каталог песочницы CLI
zh_cn: CLI 沙箱目录

# SandboxPathInput.AutomationProperties.Name
source: CLI sandbox directory path
fr_fr: Chemin du répertoire du bac à sable CLI
ja_jp: CLI サンドボックスディレクトリのパス
ru_ru: Путь к каталогу песочницы CLI
zh_cn: CLI 沙箱目录路径

# SandboxHelp.Text
source: Drive roots, Windows, Program Files, symbolic links, and junction paths are blocked.
fr_fr: Les racines de lecteur, Windows, Program Files, les liens symboliques et les chemins de jonction sont bloqués.
ja_jp: ドライブのルート、Windows、Program Files、シンボリックリンク、ジャンクションを含むパスは使用できません。
ru_ru: Корни дисков, каталоги Windows и Program Files, символические ссылки и точки соединения запрещены.
zh_cn: 禁止使用磁盘根目录、Windows、Program Files、符号链接或联接点路径。

# OnboardingLogDirectoryPath.Header
source: Translation log directory
fr_fr: Répertoire des journaux de traduction
ja_jp: 翻訳ログディレクトリ
ru_ru: Каталог журналов перевода
zh_cn: 翻译日志目录

# OnboardingLogDirectoryPath.AutomationProperties.Name
source: Translation log storage directory path
fr_fr: Chemin du répertoire de stockage des journaux de traduction
ja_jp: 翻訳ログの保存先ディレクトリ
ru_ru: Путь к каталогу хранения журналов перевода
zh_cn: 翻译日志存储目录路径

# OnboardingBrowseLogDirectoryButton.Content
source: Browse…
fr_fr: Parcourir…
ja_jp: 参照…
ru_ru: Обзор…
zh_cn: 浏览…

# OnboardingBrowseLogDirectoryButton.AutomationProperties.Name
source: Choose the translation log directory
fr_fr: Choisir le répertoire des journaux de traduction
ja_jp: 翻訳ログディレクトリを選択
ru_ru: Выбрать каталог журналов перевода
zh_cn: 选择翻译日志目录

# OnboardingLogDirectoryHelp.Text
source: Choose a local directory. Each translation makes a best-effort background write to separate Debug and all-level .log files; the newest 500 sessions are retained. Bounded logging never blocks translation.
fr_fr: Choisissez un répertoire local. Chaque traduction tente d’écrire en arrière-plan dans des fichiers .log Debug et tous niveaux distincts ; les 500 sessions les plus récentes sont conservées. La journalisation limitée ne bloque jamais la traduction.
ja_jp: ローカルディレクトリを選択してください。翻訳ごとに、Debug と全レベルの個別の .log ファイルへバックグラウンドで可能な限り書き込み、最新 500 セッションを保持します。上限付きのログ処理が翻訳を妨げることはありません。
ru_ru: Выберите локальный каталог. При каждом переводе приложение по возможности записывает в фоне отдельные файлы .log для Debug и всех уровней; сохраняются последние 500 сеансов. Журналирование с ограниченным объёмом никогда не блокирует перевод.
zh_cn: 请选择本地目录；目录可写时，每次翻译会尽力在后台持久化 Debug 与全部级别两份 .log，并保留最新 500 次会话。写入采用有界队列，慢速日志不会阻塞翻译。

# OnboardingModelTitle.Text
source: Configure the model connection
fr_fr: Configurez la connexion au modèle
ja_jp: モデル接続を設定
ru_ru: Настройте подключение к модели
zh_cn: 配置模型连接

# OnboardingModelBody.Text
source: Configure local Ollama or a network model based on your first-page choice. The endpoint and model name remain editable.
fr_fr: Configurez Ollama local ou un modèle réseau selon votre choix sur la première page. Le point de terminaison et le nom du modèle restent modifiables.
ja_jp: 最初のページでの選択に基づき、ローカル Ollama またはネットワークモデルを設定します。エンドポイントとモデル名は後から編集できます。
ru_ru: Настройте локальную Ollama или сетевую модель в соответствии с выбором на первой странице. Адрес сервиса и имя модели можно изменить.
zh_cn: 根据首屏选择配置本地 Ollama 或网络大模型；地址和模型名称均可编辑。

# ConfigureOllamaCheckBox.Content
source: Configure local Ollama now
fr_fr: Configurer Ollama local maintenant
ja_jp: 今すぐローカル Ollama を設定する
ru_ru: Настроить локальную Ollama сейчас
zh_cn: 现在配置本机 Ollama

# OllamaEndpointInput.Header
source: Service address
fr_fr: Adresse du service
ja_jp: サービスアドレス
ru_ru: Адрес сервиса
zh_cn: 服务地址

# OllamaModelInput.Header
source: Downloaded model name
fr_fr: Nom du modèle téléchargé
ja_jp: ダウンロード済みモデル名
ru_ru: Имя загруженной модели
zh_cn: 已下载模型名称

# OnboardingNetworkPresetSelector.Header
source: Network model provider
fr_fr: Fournisseur du modèle réseau
ja_jp: ネットワークモデルプロバイダー
ru_ru: Провайдер сетевой модели
zh_cn: 网络模型提供方

# OnboardingNetworkPresetSelector.AutomationProperties.Name
source: Network model provider preset
fr_fr: Préréglage du fournisseur du modèle réseau
ja_jp: ネットワークモデルプロバイダーのプリセット
ru_ru: Предустановка провайдера сетевой модели
zh_cn: 网络模型提供方预设

# OnboardingNetworkEndpointInput.Header
source: HTTPS service endpoint
fr_fr: Point de terminaison HTTPS du service
ja_jp: HTTPS サービスエンドポイント
ru_ru: Конечная точка сервиса HTTPS
zh_cn: HTTPS 服务地址

# OnboardingNetworkEndpointInput.AutomationProperties.Name
source: Network model HTTPS service endpoint
fr_fr: Point de terminaison HTTPS du service de modèle réseau
ja_jp: ネットワークモデルの HTTPS サービスエンドポイント
ru_ru: Конечная точка HTTPS сервиса сетевой модели
zh_cn: 网络模型 HTTPS 服务地址

# OnboardingNetworkModelInput.Header
source: Model name
fr_fr: Nom du modèle
ja_jp: モデル名
ru_ru: Имя модели
zh_cn: 模型名称

# OnboardingNetworkTokenLimitParameter.Header
source: Completion token parameter
fr_fr: Paramètre des jetons de complétion
ja_jp: 完了トークンパラメーター
ru_ru: Параметр ограничения токенов ответа
zh_cn: 补全 Token 参数

# OnboardingNetworkTokenLimitParameter.AutomationProperties.Name
source: Network model completion token parameter
fr_fr: Paramètre des jetons de complétion du modèle réseau
ja_jp: ネットワークモデルの完了トークンパラメーター
ru_ru: Параметр ограничения токенов ответа сетевой модели
zh_cn: 网络模型补全 Token 参数

# OnboardingNetworkTokenLimitParameterHelp.Text
source: The preset selects the recommended field. Choose a different compatible field, or omit it and let the provider decide.
fr_fr: Le préréglage sélectionne le champ recommandé. Choisissez un autre champ compatible, ou omettez-le et laissez le fournisseur décider.
ja_jp: プリセットが推奨フィールドを選択します。別の互換フィールドを選ぶか、送信せずにプロバイダー側の決定に任せることもできます。
ru_ru: Предустановка выбирает рекомендуемое поле. Выберите другое совместимое поле либо не указывайте его и позвольте провайдеру принять решение.
zh_cn: 预设会自动选择推荐字段；也可切换兼容字段，或选择不发送并由服务端决定。

# OnboardingNetworkApiKeyInput.AutomationProperties.Name
source: Network model API key
fr_fr: Clé API du modèle réseau
ja_jp: ネットワークモデルの API キー
ru_ru: Ключ API сетевой модели
zh_cn: 网络模型 API Key

# OnboardingNetworkCredentialHelp.Text
source: The API key is written only to Windows Credential Manager. Settings and logs retain only its credential reference.
fr_fr: La clé API est stockée uniquement dans Windows Credential Manager. Les paramètres et les journaux n’en conservent qu’une référence.
ja_jp: API キーは Windows 資格情報マネージャーにのみ書き込まれます。設定とログには資格情報への参照だけが保存されます。
ru_ru: Ключ API записывается только в Диспетчер учётных данных Windows. В настройках и журналах сохраняется лишь ссылка на учётные данные.
zh_cn: API Key 只会写入 Windows 凭据管理器；配置和日志仅保留凭据引用。

# SkipModelSetupButton.Content
source: Set up models later
fr_fr: Configurer les modèles plus tard
ja_jp: モデルの設定を後で行う
ru_ru: Настроить модели позже
zh_cn: 稍后设置模型

# SummaryTitle.Text
source: Ready to complete secure setup
fr_fr: Prêt à terminer la configuration sécurisée
ja_jp: 安全なセットアップを完了する準備ができました
ru_ru: Всё готово к завершению безопасной настройки
zh_cn: 准备完成安全设置

# SummaryBody.Text
source: Review these locations. Finishing creates the credential master key and encrypts settings.
fr_fr: Vérifiez ces emplacements. La finalisation crée la clé principale des informations d’identification et chiffre les paramètres.
ja_jp: これらの場所を確認してください。完了すると資格情報のマスターキーが作成され、設定が暗号化されます。
ru_ru: Проверьте указанные расположения. При завершении будет создан главный ключ, а настройки будут зашифрованы.
zh_cn: 确认以下位置。完成后会创建凭据主密钥并加密保存配置。

# SummaryLanguageTitle.Text
source: Interface language
fr_fr: Langue de l’interface
ja_jp: 表示言語
ru_ru: Язык интерфейса
zh_cn: 界面语言

# SummarySecurity.Text
source: Settings use AES-256-GCM. The master key lives only in Windows Credential Manager.
fr_fr: Les paramètres utilisent AES-256-GCM. La clé principale réside uniquement dans Windows Credential Manager.
ja_jp: 設定には AES-256-GCM を使用します。マスターキーは Windows 資格情報マネージャーにのみ保存されます。
ru_ru: Настройки защищены с помощью AES-256-GCM. Главный ключ хранится только в Диспетчере учётных данных Windows.
zh_cn: 配置使用 AES-256-GCM；主密钥仅存放在 Windows 凭据管理器。

# SummaryLocalModelTitle.Text
source: Local model: Ollama
fr_fr: Modèle local : Ollama
ja_jp: ローカルモデル: Ollama
ru_ru: Локальная модель: Ollama
zh_cn: 本地模型：Ollama

# SummaryNetworkModelTitle.Text
source: Network model (API key will be stored securely)
fr_fr: Modèle réseau (la clé API sera stockée de manière sécurisée)
ja_jp: ネットワークモデル（API キーは安全に保存されます）
ru_ru: Сетевая модель (ключ API будет сохранён безопасно)
zh_cn: 网络模型（API Key 将安全保存）

# SummaryModelSkipped.Text
source: Model setup is skipped for now. You can add one later under Model sources.
fr_fr: La configuration du modèle est ignorée pour le moment. Vous pourrez en ajouter un plus tard dans Sources de modèles.
ja_jp: 今回はモデルの設定を省略します。後から「モデルソース」で追加できます。
ru_ru: Настройка модели пока пропущена. Позже её можно добавить в разделе «Источники моделей».
zh_cn: 本次跳过模型配置，可稍后在“模型源”中添加。

# OnboardingExitButton.Content
source: Exit
fr_fr: Quitter
ja_jp: 終了
ru_ru: Выйти
zh_cn: 退出

# OnboardingBackButton.Content
source: Back
fr_fr: Retour
ja_jp: 戻る
ru_ru: Назад
zh_cn: 返回

# OnboardingNextButton.Content
source: Continue
fr_fr: Continuer
ja_jp: 続行
ru_ru: Продолжить
zh_cn: 继续

# OnboardingCompleteButton.Content
source: Save securely and start
fr_fr: Enregistrer de manière sécurisée et démarrer
ja_jp: 安全に保存して開始
ru_ru: Сохранить в защищённом виде и начать
zh_cn: 安全保存并开始

# DashboardTitle.Text
source: Translation processing queue
fr_fr: File de traitement des traductions
ja_jp: 翻訳処理キュー
ru_ru: Очередь обработки переводов
zh_cn: 翻译处理队列

# DashboardSubtitle.Text
source: Add JARs, ZIPs, or resource-pack folders. Failed and cancelled jobs roll back automatically.
fr_fr: Ajoutez des fichiers JAR, ZIP ou des dossiers de packs de ressources. Les tâches échouées et annulées sont automatiquement restaurées.
ja_jp: JAR、ZIP、またはリソースパックのフォルダーを追加します。失敗またはキャンセルされたジョブは自動的にロールバックされます。
ru_ru: Добавляйте файлы JAR и ZIP или папки наборов ресурсов. Неудачные и отменённые задания откатываются автоматически.
zh_cn: 添加 JAR、ZIP 或资源包文件夹；任务失败或取消时会自动回滚。

# DashboardModelSelector.Header
source: Model for new requests
fr_fr: Modèle pour les nouvelles demandes
ja_jp: 新しいリクエストに使用するモデル
ru_ru: Модель для новых запросов
zh_cn: 新请求使用的模型

# DashboardModelSelector.PlaceholderText
source: No configured models
fr_fr: Aucun modèle configuré
ja_jp: 設定済みのモデルがありません
ru_ru: Нет настроенных моделей
zh_cn: 没有已配置的模型

# DashboardTargetLanguageSelector.Header
source: Target language for new requests
fr_fr: Langue cible des nouvelles demandes
ja_jp: 新しいリクエストの翻訳先言語
ru_ru: Новый целевой язык
zh_cn: 新请求的目标语言

# DashboardTargetLanguageSelector.AutomationProperties.Name
source: Target language for new translation requests
fr_fr: Langue cible des nouvelles demandes de traduction
ja_jp: 新しい翻訳リクエストの翻訳先言語
ru_ru: Целевой язык для новых запросов на перевод
zh_cn: 新翻译请求的目标语言

# DashboardTargetLanguageSelector.AutomationProperties.HelpText
source: The source language is selected automatically from the package. If English is the target and no English resource exists, another available locale is used as the source.
fr_fr: La langue source est sélectionnée automatiquement parmi les ressources du paquet. Si l’anglais est la cible et qu’aucune ressource anglaise n’existe, une autre langue disponible est utilisée comme source.
ja_jp: ソース言語はパッケージ内のリソースから自動的に選択されます。英語を翻訳先に指定し、英語リソースがない場合は、別の利用可能なロケールがソースとして使用されます。
ru_ru: Исходный язык выбирается автоматически из ресурсов пакета. Если целевым является английский, а английских ресурсов нет, в качестве исходного будет использована другая доступная локаль.
zh_cn: 源语言会从包内资源自动选择；目标为英语且没有英文资源时，将使用其他可用语种作为源文。

# DashboardTargetLanguageHelp.Text
source: The source language is selected automatically from the package. If English is the target and no English resource exists, another available locale is used as the source.
fr_fr: La langue source est sélectionnée automatiquement parmi les ressources du paquet. Si l’anglais est la cible et qu’aucune ressource anglaise n’existe, une autre langue disponible est utilisée comme source.
ja_jp: ソース言語はパッケージ内のリソースから自動的に選択されます。英語を翻訳先に指定し、英語リソースがない場合は、別の利用可能なロケールがソースとして使用されます。
ru_ru: Исходный язык выбирается автоматически из ресурсов пакета. Если целевым является английский, а английских ресурсов нет, в качестве исходного будет использована другая доступная локаль.
zh_cn: 源语言会从包内资源自动选择；目标为英语且没有英文资源时，将使用其他可用语种作为源文。

# DashboardStyleSelector.Header
source: Translation style for new requests
fr_fr: Style de traduction des nouvelles demandes
ja_jp: 新しいリクエストの翻訳スタイル
ru_ru: Стиль перевода для новых запросов
zh_cn: 新请求的翻译风格

# ConfiguredStatusRun.Text
source: Configured
fr_fr: Configuré
ja_jp: 設定済み
ru_ru: Настроено
zh_cn: 已配置

# AddPackageButtonText.Text
source: Add package
fr_fr: Ajouter un paquet
ja_jp: パッケージを追加
ru_ru: Добавить пакет
zh_cn: 添加包

# AddFolderButtonText.Text
source: Add expanded package
fr_fr: Ajouter un dossier
ja_jp: フォルダーを追加
ru_ru: Добавить папку
zh_cn: 添加已展开的包

# DashboardError.Title
source: Cannot continue
fr_fr: Impossible de continuer
ja_jp: 続行できません
ru_ru: Невозможно продолжить
zh_cn: 无法继续

# DashboardStatus.Title
source: Queue status
fr_fr: État de la file
ja_jp: キューの状態
ru_ru: Состояние очереди
zh_cn: 队列状态

# QueueEmptyTitle.Text
source: No jobs in the queue
fr_fr: Aucune tâche dans la file
ja_jp: キューにジョブがありません
ru_ru: В очереди нет заданий
zh_cn: 队列中还没有任务

# QueueEmptyBody.Text
source: Supports mod JARs, shader or resource-pack ZIPs, and expanded resource-pack folders.
fr_fr: Prend en charge les JAR de mods, les ZIP de shaders ou de packs de ressources et les dossiers de packs de ressources décompressés.
ja_jp: Mod の JAR、シェーダーまたはリソースパックの ZIP、展開済みリソースパックのフォルダーに対応しています。
ru_ru: Поддерживаются моды JAR, файлы ZIP с шейдерами или наборами ресурсов, а также распакованные папки наборов ресурсов.
zh_cn: 支持模组 JAR、光影/材质包 ZIP 和已展开的资源包文件夹。

# QueueEmptyAddButton.Content
source: Add the first package
fr_fr: Ajouter le premier paquet
ja_jp: 最初のパッケージを追加
ru_ru: Добавить первый пакет
zh_cn: 添加第一个包

# QueueList.AutomationProperties.Name
source: Translation job queue
fr_fr: File des tâches de traduction
ja_jp: 翻訳ジョブキュー
ru_ru: Очередь заданий перевода
zh_cn: 翻译任务队列

# QueueDetailsExpander.AutomationProperties.HelpText
source: Click the card summary, or focus it and press Enter or Space, to expand or collapse the backend-reported stage details.
fr_fr: Cliquez sur le résumé de la carte, ou placez le focus dessus et appuyez sur Entrée ou Espace, pour développer ou réduire les détails des étapes signalés par le backend.
ja_jp: カードの概要をクリックするか、フォーカスして Enter キーまたは Space キーを押すと、バックエンドから報告されたステージの詳細を展開または折りたためます。
ru_ru: Щёлкните краткое описание карточки либо переведите на него фокус и нажмите Enter или Пробел, чтобы развернуть или свернуть сведения об этапах, полученные от серверной части.
zh_cn: 单击卡片摘要，或聚焦后按 Enter/空格键，可展开或收起真实阶段详情。

# QueueCurrentActionLabel.Text
source: Current action
fr_fr: Action actuelle
ja_jp: 現在の処理
ru_ru: Текущее действие
zh_cn: 当前操作

# QueueNextActionLabel.Text
source: Next action
fr_fr: Action suivante
ja_jp: 次の処理
ru_ru: Следующее действие
zh_cn: 下一步

# QueueNoNextAction.Text
source: The backend is not currently reporting a later stage.
fr_fr: Le backend ne signale actuellement aucune étape ultérieure.
ja_jp: 現在、バックエンドから後続ステージは報告されていません。
ru_ru: Серверная часть сейчас не сообщает о последующем этапе.
zh_cn: 后端当前未报告后续阶段。

# QueueTimelineTitle.Text
source: Overall step timeline
fr_fr: Chronologie générale des étapes
ja_jp: 全ステップのタイムライン
ru_ru: Общая шкала этапов
zh_cn: 总步骤时间线

# QueueTimeline.AutomationProperties.Name
source: Backend-reported translation step timeline
fr_fr: Chronologie des étapes de traduction signalées par le backend
ja_jp: バックエンドから報告された翻訳ステップのタイムライン
ru_ru: Шкала этапов перевода, полученная от серверной части
zh_cn: 后端报告的翻译步骤时间线

# QueueFailureDetailsTitle.Text
source: Failure and rollback
fr_fr: Échec et restauration
ja_jp: 失敗とロールバック
ru_ru: Сбой и откат
zh_cn: 失败与回滚

# QueueTechnicalDetailsTitle.Text
source: Technical details
fr_fr: Détails techniques
ja_jp: 技術的な詳細
ru_ru: Технические сведения
zh_cn: 技术详情

# CancelQueueItemButtonText.Text
source: Cancel
fr_fr: Annuler
ja_jp: キャンセル
ru_ru: Отменить
zh_cn: 取消
